# Groupby
-  allow to group togetherrows based off a column and perform aggregate function (similar to sql)

In [3]:
import numpy as np
import pandas as pd

In [4]:
data = {
    'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
    'Person': ['Sam', 'Charlie', 'Amy', 'Ven', 'Carl', 'Sarah'],
    'Sales': [100, 200, 300, 400, 500, 600]
}

In [6]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    100
1    GOOG  Charlie    200
2    MSFT      Amy    300
3    MSFT      Ven    400
4      FB     Carl    500
5      FB    Sarah    600

In [8]:
df.groupby('Company') #get a groupby object

In [9]:
byComp = df.groupby('Company')

In [10]:
byComp.mean()

C:\Users\ACER\AppData\Local\Temp\ipykernel_10740\1270089407.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  byComp.mean()

         Sales
Company
FB       550.0
GOOG     150.0
MSFT     350.0

In [11]:
byComp.std()

C:\Users\ACER\AppData\Local\Temp\ipykernel_10740\3568384627.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.std is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  byComp.std()

             Sales
Company
FB       70.710678
GOOG     70.710678
MSFT     70.710678

In [16]:
byComp.mean().loc['FB']

C:\Users\ACER\AppData\Local\Temp\ipykernel_10740\4192316779.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  byComp.mean().loc['FB']

Sales    550.0
Name: FB, dtype: float64

In [13]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [17]:
df.groupby('Company').max()

        Person  Sales
Company
FB       Sarah    600
GOOG       Sam    200
MSFT       Ven    400

# Getting analyse information

In [20]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   550.000000  150.000000  350.000000
      std     70.710678   70.710678   70.710678
      min    500.000000  100.000000  300.000000
      25%    525.000000  125.000000  325.000000
      50%    550.000000  150.000000  350.000000
      75%    575.000000  175.000000  375.000000
      max    600.000000  200.000000  400.000000

In [21]:
df.groupby('Company').describe()

        Sales
        count   mean        std    min    25%    50%    75%    max
Company
FB        2.0  550.0  70.710678  500.0  525.0  550.0  575.0  600.0
GOOG      2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0
MSFT      2.0  350.0  70.710678  300.0  325.0  350.0  375.0  400.0